import random
import spacy
from spacy.tokens import DocBin


def create_spacy_file():
    nlp = spacy.blank("ru")

    train_data = [
        ("Пациенту назначено МРТ головного мозга", {"entities": [(19, 38, "PROCEDURE")]}),
        ("Необходимо сделать КТ грудной клетки", {"entities": [(21, 39, "PROCEDURE")]}),
        ("Назначена сдача общего анализа крови", {"entities": [(10, 38, "PROCEDURE")]}),
        ("Планируется УЗИ брюшной полости", {"entities": [(12, 33, "PROCEDURE")]}),
        ("Проводится гастроскопия", {"entities": [(11, 24, "PROCEDURE")]}),
        ("Запланирована колоноскопия", {"entities": [(14, 27, "PROCEDURE")]}),
        ("Будет выполнена биопсия печени", {"entities": [(17, 31, "PROCEDURE")]}),
        ("Производится рентген тазобедренного сустава", {"entities": [(13, 43, "PROCEDURE")]}),
        ("Выполнен тест на толерантность к глюкозе", {"entities": [(9, 42, "PROCEDURE")]}),
        ("Назначена пункция спинномозговой жидкости", {"entities": [(10, 43, "PROCEDURE")]}),
        ("Проведена ангиография сосудов головного мозга", {"entities": [(10, 45, "PROCEDURE")]}),
        ("Проводится МСКТ грудной клетки", {"entities": [(11, 30, "PROCEDURE")]}),
        ("Назначен тест на гормоны щитовидной железы", {"entities": [(9, 45, "PROCEDURE")]}),
        ("Сделано ПЦР-исследование на коронавирус", {"entities": [(8, 41, "PROCEDURE")]}),
        ("Проведена ирригоскопия", {"entities": [(10, 25, "PROCEDURE")]}),
        ("Проводится биохимический анализ крови", {"entities": [(11, 42, "PROCEDURE")]}),
        ("Проведена магнитно-резонансная ангиография", {"entities": [(10, 45, "PROCEDURE")]}),
        ("Сделано исследование функции печени", {"entities": [(8, 39, "PROCEDURE")]}),
        ("Произведена сцинтиграфия костей скелета", {"entities": [(12, 42, "PROCEDURE")]}),
        ("Планируется УЗИ сердца", {"entities": [(12, 23, "PROCEDURE")]}),
        ("Выполнена рентгенография черепа", {"entities": [(10, 36, "PROCEDURE")]}),
        ("Пациент направлен на электромиографию", {"entities": [(23, 43, "PROCEDURE")]}),
        ("Сдан анализ на гепатит B и C", {"entities": [(5, 32, "PROCEDURE")]}),
        ("Назначено исследование кала на паразитов", {"entities": [(10, 44, "PROCEDURE")]}),
        ("Проведено УЗИ органов малого таза", {"entities": [(10, 37, "PROCEDURE")]}),
        ("Планируется биопсия щитовидной железы", {"entities": [(12, 40, "PROCEDURE")]}),
        ("Проведена ЭКГ с нагрузкой", {"entities": [(10, 28, "PROCEDURE")]}),
        ("Назначен мазок на флору", {"entities": [(9, 27, "PROCEDURE")]}),
        ("Сделан мазок на цитологию", {"entities": [(7, 31, "PROCEDURE")]}),
        ("Проводится проба Реберга", {"entities": [(11, 28, "PROCEDURE")]}),
        ("Выполнен тест с глюкозной нагрузкой", {"entities": [(9, 39, "PROCEDURE")]}),
        ("Планируется колоноскопия с биопсией", {"entities": [(12, 37, "PROCEDURE")]}),
        ("Проведена рентгенография грудной клетки", {"entities": [(10, 42, "PROCEDURE")]}),
        ("Пациент направлен на УЗИ вен нижних конечностей", {"entities": [(23, 53, "PROCEDURE")]}),
        ("Сдан анализ кала на дисбактериоз", {"entities": [(5, 37, "PROCEDURE")]}),
        ("Назначено исследование синовиальной жидкости", {"entities": [(10, 46, "PROCEDURE")]}),
        ("Выполнена компьютерная томография шейного отдела", {"entities": [(10, 49, "PROCEDURE")]}),
        ("Сделано исследование кислотности желудочного сока", {"entities": [(8, 50, "PROCEDURE")]}),
        ("Проводится МРТ поясничного отдела позвоночника", {"entities": [(11, 48, "PROCEDURE")]}),
        ("Пациенту назначено УЗИ щитовидной железы", {"entities": [(19, 43, "PROCEDURE")]}),
        ("Планируется гастроскопия с биопсией", {"entities": [(12, 37, "PROCEDURE")]}),
        ("Проводится пункция коленного сустава", {"entities": [(11, 40, "PROCEDURE")]}),
        ("Выполнено исследование крови на свертываемость", {"entities": [(10, 48, "PROCEDURE")]}),
        ("Пациент направлен на рентген носовых пазух", {"entities": [(23, 50, "PROCEDURE")]}),
        ("Назначено УЗИ плода", {"entities": [(10, 22, "PROCEDURE")]}),
        ("Проводится осмотр с помощью кольпоскопа", {"entities": [(11, 45, "PROCEDURE")]}),
        ("Сделана биопсия простаты", {"entities": [(8, 27, "PROCEDURE")]}),
        ("Проведено ПЦР-исследование мочи", {"entities": [(10, 37, "PROCEDURE")]}),
        ("Пациент направлен на ЭЭГ", {"entities": [(23, 26, "PROCEDURE")]}),
        ("Проводится функциональная диагностика дыхания", {"entities": [(11, 50, "PROCEDURE")]}),
        ("Планируется бронхоскопия", {"entities": [(12, 28, "PROCEDURE")]}),
        ("Назначено УЗИ органов брюшной полости", {"entities": [(10, 41, "PROCEDURE")]}),
        ("Сделан тест на аллергены", {"entities": [(7, 29, "PROCEDURE")]}),
        ("Проведена ангиография почечных артерий", {"entities": [(10, 41, "PROCEDURE")]}),
        ("Сдан анализ мокроты", {"entities": [(5, 23, "PROCEDURE")]}),
        ("Проводится флюорография грудной клетки", {"entities": [(11, 43, "PROCEDURE")]}),
        ("Выполнен анализ спинномозговой жидкости", {"entities": [(9, 42, "PROCEDURE")]}),
        ("Назначен туберкулиновый тест", {"entities": [(9, 33, "PROCEDURE")]}),
        ("Проведена биопсия лимфоузла", {"entities": [(10, 32, "PROCEDURE")]}),
        ("Планируется уретроскопия", {"entities": [(12, 28, "PROCEDURE")]}),
        ("Сдан анализ кала на гельминты", {"entities": [(5, 35, "PROCEDURE")]}),
        ("Проведена денситометрия", {"entities": [(10, 29, "PROCEDURE")]}),
        ("Проводится электронейромиография", {"entities": [(11, 39, "PROCEDURE")]}),
        ("Пациент сдаёт кровь на сахар", {"entities": [(14, 34, "PROCEDURE")]}),
        ("Планируется УЗИ молочных желёз", {"entities": [(12, 36, "PROCEDURE")]}),
        ("Назначено УЗИ почек и надпочечников", {"entities": [(10, 41, "PROCEDURE")]}),
        ("Выполнен рентген кистей рук", {"entities": [(9, 31, "PROCEDURE")]}),
        ("Сделана томография органов грудной клетки", {"entities": [(8, 44, "PROCEDURE")]}),
        ("Проведено обследование перед операцией", {"entities": [(10, 41, "PROCEDURE")]}),
        ("Сдан тест на маркеры гепатита", {"entities": [(5, 35, "PROCEDURE")]}),
        ("Пациент направлен на КТ почек", {"entities": [(23, 33, "PROCEDURE")]}),
        ("Назначена УЗИ диагностика печени", {"entities": [(10, 36, "PROCEDURE")]}),
        ("Проводится допплерография артерий нижних конечностей", {"entities": [(11, 56, "PROCEDURE")]}),
        ("Сделано исследование функции почек", {"entities": [(8, 37, "PROCEDURE")]}),
        ("Пациент сдал кровь на холестерин", {"entities": [(14, 39, "PROCEDURE")]}),
        ("Проведена УЗИ фолликулов", {"entities": [(10, 28, "PROCEDURE")]}),
        ("Проведена ретгенография грудной клетки в двух проекциях", {"entities": [(10, 55, "PROCEDURE")]}),
        ("Проводится спирометрия", {"entities": [(11, 25, "PROCEDURE")]}),
        ("Проведён экспресс-тест на грипп", {"entities": [(9, 35, "PROCEDURE")]}),
        ("Сдан мазок из зева", {"entities": [(5, 22, "PROCEDURE")]}),
        ("Проводится гистероскопия", {"entities": [(11, 28, "PROCEDURE")]}),
        ("Пациенту назначено МРТ головного мозга", {"entities": [(19, 38, "PROCEDURE")]}),
        ("Необходимо сделать КТ грудной клетки", {"entities": [(21, 39, "PROCEDURE")]}),
        ("Назначена сдача общего анализа крови", {"entities": [(10, 38, "PROCEDURE")]}),
        ("Планируется УЗИ брюшной полости", {"entities": [(12, 33, "PROCEDURE")]}),
        ("Проводится гастроскопия", {"entities": [(11, 24, "PROCEDURE")]}),
        ("Запланирована колоноскопия", {"entities": [(14, 27, "PROCEDURE")]}),
        ("Будет выполнена биопсия печени", {"entities": [(17, 31, "PROCEDURE")]}),
        ("Производится рентген тазобедренного сустава", {"entities": [(13, 43, "PROCEDURE")]}),
        ("Выполнен тест на толерантность к глюкозе", {"entities": [(9, 42, "PROCEDURE")]}),
        ("Назначена пункция спинномозговой жидкости", {"entities": [(10, 43, "PROCEDURE")]}),
        ("Проведена эхокардиография сердца", {"entities": [(10, 34, "PROCEDURE")]}),
        ("Пациент направлен на допплерографию сосудов шеи", {"entities": [(23, 54, "PROCEDURE")]}),
        ("Сделана электрокардиограмма", {"entities": [(8, 31, "PROCEDURE")]}),
        ("Проведён забор крови на биохимию", {"entities": [(10, 37, "PROCEDURE")]}),
        ("Проведено суточное мониторирование ЭКГ", {"entities": [(10, 42, "PROCEDURE")]}),
        ("Назначено исследование функции внешнего дыхания", {"entities": [(10, 50, "PROCEDURE")]}),
        ("Врач назначил холтеровское мониторирование", {"entities": [(13, 44, "PROCEDURE")]}),
        ("Выполнена фиброгастроскопия", {"entities": [(10, 31, "PROCEDURE")]}),
        ("Проведена цистоскопия", {"entities": [(10, 23, "PROCEDURE")]}),
        ("Планируется ангиография сосудов сердца", {"entities": [(12, 41, "PROCEDURE")]}),
        ("Сделан рентген грудной клетки", {"entities": [(7, 29, "PROCEDURE")]}),
        ("Произведена рентгенография позвоночника", {"entities": [(12, 41, "PROCEDURE")]}),
        ("Выполнена лапароскопия", {"entities": [(10, 25, "PROCEDURE")]}),
        ("Проводится тест на ВИЧ", {"entities": [(11, 25, "PROCEDURE")]}),
        ("Проведена проба Манту", {"entities": [(10, 23, "PROCEDURE")]}),
        ("Запланирована томография головного мозга", {"entities": [(14, 42, "PROCEDURE")]}),
        ("Пациент сдаёт общий анализ мочи", {"entities": [(14, 36, "PROCEDURE")]}),
        ("Проводится исследование кала на скрытую кровь", {"entities": [(13, 49, "PROCEDURE")]}),
        ("Пациент направлен на тредмил-тест", {"entities": [(23, 36, "PROCEDURE")]}),
        ("Назначена ЭЭГ головного мозга", {"entities": [(10, 30, "PROCEDURE")]}),
        ("Производится УЗДГ сосудов нижних конечностей", {"entities": [(13, 48, "PROCEDURE")]}),
        ("Сдан анализ на уровень глюкозы в крови", {"entities": [(5, 39, "PROCEDURE")]}),
        ("Пациент направлен на флюорографию", {"entities": [(23, 39, "PROCEDURE")]})
    ]

    doc_bin = DocBin()

    for text, annotations in train_data:
        doc = nlp.make_doc(text)
        entities = []
        for start, end, label in annotations["entities"]:
            span = doc.char_span(start, end, label=label)
            if span:
                entities.append(span)
        doc.ents = entities
        doc_bin.add(doc)

    doc_bin.to_disk("medical_procedures.spacy")


def split_spacy_file_by_dev_and_train():
    nlp = spacy.blank("ru")
    doc_bin = DocBin().from_disk("merged_data.spacy")
    docs = list(doc_bin.get_docs(nlp.vocab))

    random.shuffle(docs)
    split = int(len(docs) * 0.9)
    train_docs = docs[:split]
    dev_docs = docs[split:]

    DocBin(docs=train_docs).to_disk("train.spacy")
    DocBin(docs=dev_docs).to_disk("dev.spacy")


if __name__ == '__main__':
    split_spacy_file_by_dev_and_train()